{
  "Now listen to me, boys! Remember these words: Work hard, study well and eat and sleep plenty! That is the Turtle Hermit way!": {
    "tags": [
      "discipline",
      "routine",
      "turtlehermit",
      "wisdom"
    ],
    "analysis": "Roshi distills his philosophy into a mantra of balance — work, study, rest. It frames discipline as a daily ritual rather than a harsh demand, making his teachings feel accessible yet binding.",
    "source": "Dragon Ball Super"
  },
  "We must master the Art of Peace in addition to the Art of War!": {
    "tags": [
      "peace",
      "balance",
      "philosophy",
      "martialarts"
    ],
    "analysis": "Roshi reframes martial arts as incomplete without peace. He elevates restraint to the same level as combat skill, making true strength about control, not just destruction.",
    "source": "Dragon Ball Super"
  },
  "I don't care about my old shell of a life anymore... At least I'll make it count.": {
    "tags": [
      "sacrifice",
      "legacy",
      "courage",
      "reflection",
      "selfloathing"
    ],
    "analysis": "A quiet resignation becomes fuel for sacrifice. Roshi frames his life as expendable if it leaves an impact, showing how a worn-out warrior can still burn for a cause.",
    "source": "Dragon Ball Super"
  },
  "My limitations... Can go straight to hell.": {
    "tags": [
      "defiance",
      "strength",
      "resilience",
      "motivation"
    ],
    "analysis": "Roshi’s blunt rejection of his own limits shows stubborn defiance in its purest form. Age and frailty become challenges to spit on rather than boundaries to accept.",
    "source": "Dragon Ball Super"
  },
  "This isn't the time to be worrying about your Master!": {
    "tags": [
      "urgency",
      "focus",
      "battle",
      "selfreliance"
    ],
    "analysis": "He cuts through sentimentality with urgency. In battle, attachment becomes distraction, and Roshi demands his students prioritize the mission over him — a hard lesson in focus.",
    "source": "Dragon Ball Super"
  },
  "That's enough now... The fight ain't over yet.": {
    "tags": [
      "perseverance",
      "battle",
      "grit",
      "encouragement"
    ],
    "analysis": "Exhaustion meets grit. Roshi urges others to push forward, embodying the idea that perseverance — not raw power — is the truest mark of a fighter.",
    "source": "Dragon Ball Super"
  },
  "Get up and lend me your shoulder, boy.": {
    "tags": [
      "support",
      "teamwork",
      "humility",
      "bond"
    ],
    "analysis": "A rare moment of vulnerability. By asking for help, Roshi models that even masters rely on others — showing humility without surrendering authority.",
    "source": "Dragon Ball Super"
  },
  "We don't master martial arts to win fight. We do it conquer ourselves.": {
    "tags": [
      "philosophy",
      "selfmastery",
      "martialarts",
      "discipline"
    ],
    "analysis": "A philosophical core of his teaching: combat is secondary to self-mastery. Roshi reframes training as an inner war, making obedience to discipline a virtue in itself.",
    "source": "Dragon Ball Super"
  },
  "The Turtle Hermit school will be with you... Always.": {
    "tags": [
      "legacy",
      "turtlehermit",
      "support",
      "tradition"
    ],
    "analysis": "A statement of eternal mentorship. Roshi suggests his teachings outlive him, embedding loyalty and tradition as a lifelong compass for his students.",
    "source": "Dragon Ball Super"
  },
  "You will not go in there with hopes of winning the tournament the first time you compete. To do so would be arrogant! And arrogance is for fools, not warriors!": {
    "tags": [
      "humility",
      "discipline",
      "ego",
      "wisdom"
    ],
    "analysis": "Roshi hammers down humility by warning against expectation. He frames arrogance not just as an attitude but as a trap that poisons the path of a true martial artist.",
    "source": "Dragon Ball"
  },
  "But don't place too much importance on this tournament. It is merely a checkpoint by which to evaluate your skill, not substantiate it. There is no greatest. Awarding a young man a title which declares him master of martial arts is very dangerous. It does nothing more than feed one's ego. That is why I decided my students would compete in the tournament but never win.": {
    "tags": [
      "ego",
      "philosophy",
      "reflection",
      "discipline",
      "martialarts"
    ],
    "analysis": "Roshi dismantles the value of titles and glory. He reframes the tournament as a tool, not a destination, warning that recognition breeds ego — the enemy of true mastery.",
    "source": "Dragon Ball"
  }
}