{
  "Then something just snapped, something inside of me. I didn't care anymore. I didn't care about being better than Kakarot. I didn't care about being a Super Saiyan, I didn't care if I lived. Then it happened.": {
    "tags": [
      "transcendence",
      "despair",
      "awakening"
    ],
    "analysis": "This marks Vegeta’s moment of ego death, where his obsession with surpassing Goku collapses, paradoxically triggering his breakthrough. It frames transcendence as arising not from relentless striving but from surrendering to apathy toward the metrics he once worshiped.",
    "source": "Dragon Ball Z"
  },
  "You may have invaded my mind and body, but there's one thing a Saiyan always keeps... his PRIDE!": {
    "tags": [
      "pride",
      "defiance",
      "identity"
    ],
    "analysis": "Vegeta equates pride with identity itself — an untouchable core no enemy can corrupt. This transforms pride into an almost sacred, existential force, presenting resistance as rooted in unyielding self-concept.",
    "source": "Dragon Ball Z"
  },
  "Come on Kakarot, find a way! I entrusted everything to you: My pride, my promise, everything! I won't tolerate failure! Trespass into the domain of the Gods and use that power to conquer Jiren! DO IT KAKAROT!": {
    "tags": [
      "trust",
      "legacy",
      "godhood"
    ],
    "analysis": "A rare moment of faith from Vegeta, who usually frames pride as self-contained. Here, he hands his legacy and ego to Goku, fusing rivalry with trust and admitting Goku must succeed where he cannot — but still cloaking it in commanding language to retain dominance.",
    "source": "Dragon Ball Super"
  },
  "I do this for you, Bulma, Trunks... And yes, even for you... Kakarot.": {
    "tags": [
      "family",
      "redemption",
      "sacrifice"
    ],
    "analysis": "Vegeta’s motivation broadens beyond himself — for family, and even for his rival. This confession shows the humanization of a warrior once defined by selfishness, reframing sacrifice as an act of love rather than duty.",
    "source": "Dragon Ball Z"
  },
  "Final form my ass!": {
    "tags": [
      "humour",
      "combat",
      "taunt"
    ],
    "analysis": "A comedic, dismissive taunt that undercuts the opponent’s dramatics. It embodies Vegeta’s mocking defiance, using humor to reject intimidation and assert his own irreverent strength.",
    "source": "Dragon Ball Super"
  },
  "Tell me - Is it slavery when you get what you want?": {
    "tags": [
      "philosophy",
      "power",
      "freedom"
    ],
    "analysis": "Vegeta raises a sharp, unsettling philosophical challenge — reframing power dynamics and consent. He questions whether achieving desires through subjugation truly counts as freedom, blurring the lines between servitude and willing submission.",
    "source": "Dragon Ball Z"
  },
  "MEANINGLESS, HUH? WHAT DO YOU KNOW OF MEANINGLESS? Spend most of your life ruled by another! Watch your race dwindle to a handful! AND THEN, tell me what has more meaning than your own strength! I have in me the blood of a Saiyan prince. He is nothing but a joke! Yet I've had to watch him surpass me in strength, my destiny thrown to the wayside! He's... he's even saved my life as if I were a helpless child. He has stolen my honor, and his debts... must be paid!": {
    "tags": [
      "rage",
      "honour",
      "existentialism"
    ],
    "analysis": "A volcanic eruption of rage and vulnerability. Vegeta frames strength as the only antidote to generational trauma and humiliation, laying bare his jealousy and wounded pride while admitting that Goku’s very kindness feels like theft.",
    "source": "Dragon Ball Z"
  },
  "Nobody kills Kakarot while I'm around, destiny has reserved that pleasure for me": {
    "tags": [
      "rivalry",
      "possessiveness",
      "fate"
    ],
    "analysis": "A mix of rivalry and possessiveness. Vegeta’s claim reduces Goku’s life to an exclusive battleground, implying his bond with Goku is too personal for outsiders to interfere — even in killing.",
    "source": "Dragon Ball Z"
  },
  "What did you do...? TO MY BULMAAAAA!": {
    "tags": [
      "rage",
      "love",
      "vengeance"
    ],
    "analysis": "One of Vegeta’s rawest outbursts — fury stripped of prideful restraint. His love for Bulma ignites overwhelming vengeance, showing his protective instinct is the one thing stronger than his composure.",
    "source": "Dragon Ball Super"
  },
  "Let me ask you: Does a machine like yourself ever feel fear?": {
    "tags": [
      "intimidation",
      "philosophy",
      "combat"
    ],
    "analysis": "A psychological strike disguised as a question. Vegeta frames fear as a uniquely organic vulnerability, daring an artificial being to acknowledge humanity — and its own weakness.",
    "source": "Dragon Ball Z"
  },
  "The female species... Such an enigma!": {
    "tags": [
      "humour",
      "gender",
      "curiosity"
    ],
    "analysis": "A rare, almost awkward moment of humor and reflection. Vegeta admits confusion at love and relationships, contrasting his tactical mastery in combat with bafflement in intimacy.",
    "source": "Dragon Ball Z"
  },
  "This is SUPER Vegeta!": {
    "tags": [
      "confidence",
      "power",
      "transformation"
    ],
    "analysis": "Vegeta’s pride in transformation condenses into one triumphant declaration. He defines his new state not just as a power level, but as a persona — a rebirth with its own name.",
    "source": "Dragon Ball Z"
  },
  "Only you can do this. You are number one, Kakarot.": {
    "tags": [
      "respect",
      "growth",
      "humility"
    ],
    "analysis": "A moment of humility nearly unthinkable for Vegeta’s early self. He openly acknowledges Goku’s superiority, reworking rivalry into respect — and revealing his own growth.",
    "source": "Dragon Ball Z"
  },
  "It's as if there's a Super Saiyan bargain sale going on!": {
    "tags": [
      "humour",
      "sarcasm",
      "transformation"
    ],
    "analysis": "Vegeta’s sarcastic jab critiques the dilution of the once-mythic Super Saiyan title. It shows his frustration that a rare symbol of elite identity is becoming commonplace.",
    "source": "Dragon Ball Z"
  },
  "You say I'm arrogant, I say damn right! That's pride - pride in the Saiyan I am! The mighty prince of the ULTIMATE WARRIOR RACE!": {
    "tags": [
      "pride",
      "identity",
      "warrior"
    ],
    "analysis": "Vegeta reframes arrogance as justified heritage. His pride isn’t just personal — it’s collective, elevating Saiyan identity into near-divine status and using it to defend his own hubris.",
    "source": "Dragon Ball Super"
  }
}