{
  "Foolishness, Dante, foolishness. Might controls everything, and without strength, you cannot protect anything. Let alone yourself.": {
    "tags": [
      "power",
      "control",
      "protection",
      "vulnerability",
      "philosophy"
    ],
    "analysis": "Vergil’s worldview is laid bare—he equates strength with safety, and weakness with helplessness. This belief drives his pursuit of power not just for dominance, but as a shield against emotional exposure.",
    "source": "Devil May Cry 3"
  },
  "How many times... Have we fought?": {
    "tags": [
      "brotherhood",
      "conflict",
      "reflection",
      "legacy"
    ],
    "analysis": "A rare moment of introspection. Vergil isn’t just counting battles—he’s questioning the cycle of violence between him and Dante, hinting at a deeper yearning for resolution.",
    "source": "Devil May Cry 5"
  },
  "If you want it... Then you'll have to take it.": {
    "tags": [
      "challenge",
      "power",
      "will",
      "defiance"
    ],
    "analysis": "Vergil frames desire as a contest of strength. This line reflects his belief that nothing is given—everything must be earned through force or resolve.",
    "source": "Devil May Cry 5"
  },
  "What form of power is this?!": {
    "tags": [
      "power",
      "awe",
      "transformation",
      "uncertainty"
    ],
    "analysis": "A crack in Vergil’s confidence. He’s confronted with a force beyond his understanding, revealing that even he can be shaken by the unknown.",
    "source": "Devil May Cry 5"
  },
  "It's past your bedtime!": {
    "tags": [
      "fatherhood",
      "irony",
      "violence",
      "identity"
    ],
    "analysis": "Vergil finally understands that he is a father. The line is delivered with cold detachment, masking the emotional weight of confronting his own son.",
    "source": "Devil May Cry 5 - Stabbing his son"
  },
  "My power shall be absolute...": {
    "tags": [
      "ambition",
      "control",
      "obsession",
      "identity"
    ],
    "analysis": "Vergil’s ultimate goal is not just strength—it’s absolutism. He seeks a form of power that transcends limitation, reflecting his fear of vulnerability and his need to define himself through dominance.",
    "source": "Devil May Cry 5 - SDT Move"
  },
  "There is no escape!": {
    "tags": [
      "control",
      "inevitability",
      "intimidation"
    ],
    "analysis": "This line is less about physical entrapment and more about psychological pressure. Vergil asserts dominance by removing the illusion of choice.",
    "source": "Devil May Cry 5 - SDT Move"
  },
  "Now I'm a little motivated.": {
    "tags": [
      "challenge",
      "rivalry",
      "excitement",
      "pride"
    ],
    "analysis": "A rare glimpse of Vergil’s enjoyment in battle. It’s a subtle nod to his bond with Dante—only his brother can push him to this edge of exhilaration.",
    "source": "Devil May Cry 5 - SDT Move"
  }
}